/* 
   Localizable.strings
   FireEagle

   Created by Michael Malone on 7/1/08.
   Copyright 2008 __MyCompanyName__. All rights reserved.
 */
 
/* Accuracy Levels */
"AccuracyBest" = "Best";
"Accuracy10" = "10 meters";
"Accuracy100" = "100 meters";
"Acurracy1000" = "1 kilometer";
"Accuracy3000" = "3 kilometers";

/* Units */
"MeterPlural" = "meters";
"MeterSingular" = "meter";

/* Start & Stop button labels */
"StartButton" = "Start";
"StopButton" = "Stop";

/* Data unavailable messages */
"LatLongUnavailable" = "Latitude / Longitude unavailable";
"AltUnavailable" = "Altitude unavailable";

/* Formatting strings for location data output */
"LatLongFormat" = "Location: %.4f° %@, %.4f° %@";
"AltitudeFormat" = "Altitude: %.2f meters %@";
"MeterAccuracyFormat" = "(accuracy %.0f meters)";
"LocationChangedFormat" = "Location changed %.2f meters ";
"FromPreviousMeasurement" = "since previous measurement";
"TimeElapsedFormat" = "in %.1f seconds";

/* Directions */ 
"North" = "North";
"South" = "South";
"East" = "East";
"West" = "West";
"AboveSeaLevel" = "above sea level";
"BelowSeaLevel" = "below sea level";

/* Error messages */
"NoLocationServices" = "Location services are not enabled.";
"LocationDenied" = "Access to use your location was denied.";
"LocationUnknown" = "Your location could not be determined.";
"GenericLocationError" = "Unknown location error code:";